[
  {
    "id": "C001",
    "name": "Tay Cầm Chơi Game Flydigi Vader 4 Pro Controller",
    "category": "Handheld Console",
    "price": 8990000,
    "description": "Phiên bản nâng cấp với màn hình OLED 7 inch rực rỡ, hiển thị màu sắc sống động và độ tương phản cao. Chân đế điều chỉnh linh hoạt, loa ngoài cải tiến cho âm thanh mạnh mẽ hơn, và bộ nhớ trong 64GB giúp bạn lưu trữ nhiều trò chơi hơn.",
    "fullDescription": "Nintendo Switch OLED là phiên bản hoàn thiện nhất của dòng máy chơi game đình đám đến từ Nintendo. Thiết bị sở hữu màn hình OLED 7 inch sống động, mang lại hình ảnh rực rỡ, độ tương phản cao và màu đen sâu hơn hẳn so với màn hình LCD truyền thống. Nhờ đó, trải nghiệm hình ảnh khi chơi game ở mọi môi trường ánh sáng đều trở nên tuyệt vời. Chân đế thiết kế mới có thể điều chỉnh nhiều góc độ giúp việc chơi ở chế độ tabletop tiện lợi hơn bao giờ hết. Bên cạnh đó, loa ngoài được cải tiến mang lại âm thanh to và rõ hơn, giúp người chơi đắm chìm vào từng trận đấu hoặc cảnh phim. Bộ nhớ trong được nâng lên 64GB, đủ để bạn lưu trữ nhiều tựa game yêu thích mà không cần thẻ nhớ mở rộng ngay lập tức. Ngoài ra, Dock mới hỗ trợ cổng LAN, mang lại kết nối mạng ổn định và mượt mà khi chơi online. Nintendo Switch OLED là lựa chọn lý tưởng cho cả game thủ di động và người thích chơi trên màn hình lớn — một sự kết hợp hoàn hảo giữa hiệu năng, thiết kế và tính di động.",
    "specs": {
      "Màn hình": "OLED 7 inch (1280x720)",
      "Bộ nhớ trong": "64GB",
      "Kết nối": "Wi-Fi, Bluetooth 4.1, LAN (qua Dock)",
      "Thời lượng pin": "4.5 - 9 giờ",
      "Trọng lượng": "420g"
    },
    "image": "/Assets/image/products1.png",
    "gallery": [
      "/Assets/image/products1.png"
    ],
    "bonus": ["Bảo hành 12 tháng", "Tặng túi đựng console", "Tặng ốp bảo vệ Joy-Con"]
  },
  {
    "id": "C002",
    "name": "Tay Cầm Chơi Game Flydigi Apex 5 Elite Controller",
    "category": "Home Console",
    "price": 14990000,
    "description": "Máy chơi game thế hệ mới của Sony với sức mạnh xử lý vượt trội, SSD siêu nhanh và khả năng hiển thị 4K chân thực. Thiết kế hiện đại, sang trọng cùng tay cầm DualSense mang lại trải nghiệm xúc giác độc đáo.",
    "fullDescription": "PlayStation 5 Standard là biểu tượng của thế hệ console mới, đánh dấu bước nhảy vọt về công nghệ giải trí tại gia. Được trang bị CPU AMD Ryzen Zen 2 8 nhân cùng GPU RDNA 2 mạnh mẽ, PS5 mang đến hiệu năng đồ họa ấn tượng, hỗ trợ hình ảnh 4K HDR sắc nét và tốc độ khung hình ổn định. Ổ SSD tùy chỉnh dung lượng 825GB giúp thời gian tải game gần như biến mất, cho phép bạn chuyển đổi giữa các màn chơi nhanh chóng và mượt mà. Tay cầm DualSense — điểm nhấn nổi bật của PS5 — tích hợp phản hồi xúc giác tinh tế, cùng cò nhạy thích ứng, giúp bạn cảm nhận được từng cú nảy, rung hay độ căng của vũ khí trong game. Ngoài ra, hệ thống tản nhiệt mới cùng thiết kế tương lai với ánh sáng LED xanh trắng mang lại cảm giác hiện đại và cao cấp. PS5 không chỉ là máy chơi game, mà còn là trung tâm giải trí đa năng hỗ trợ xem phim, nghe nhạc, và stream nội dung 4K. Đây là sự lựa chọn hàng đầu cho game thủ mong muốn hiệu năng đỉnh cao và trải nghiệm hoàn hảo nhất hiện nay.",
    "specs": {
      "CPU": "AMD Ryzen Zen 2 8 nhân",
      "GPU": "AMD RDNA 2, 10.28 TFLOPs",
      "RAM": "16GB GDDR6",
      "Lưu trữ": "825GB SSD",
      "Độ phân giải": "Tối đa 8K",
      "Trọng lượng": "4.5 kg"
    },
    "image": "/Assets/image/products2.png",
    "gallery": [
      "/Assets/image/products2.png"
    ],
    "bonus": ["Bảo hành 12 tháng", "Miễn phí giao hàng toàn quốc"]
  },
  {
    "id": "C003",
    "name": "Steam Deck 512GB",
    "category": "Handheld PC",
    "price": 18990000,
    "description": "Máy chơi game cầm tay mạnh mẽ của Valve, chạy SteamOS và hỗ trợ hầu hết các tựa game PC. Màn hình chống chói, ổ SSD tốc độ cao và khả năng tùy chỉnh linh hoạt.",
    "fullDescription": "Steam Deck 512GB là chiếc máy chơi game cầm tay kết hợp hoàn hảo giữa sức mạnh của PC và tính di động. Được phát triển bởi Valve, Steam Deck sử dụng vi xử lý AMD APU tùy chỉnh, kết hợp CPU Zen 2 và GPU RDNA 2, mang lại hiệu năng mạnh mẽ đủ để chạy mượt các tựa game AAA hiện nay. Phiên bản 512GB trang bị ổ SSD NVMe tốc độ cao, giúp rút ngắn đáng kể thời gian tải và cải thiện trải nghiệm tổng thể. Màn hình cảm ứng 7 inch chống chói giúp hiển thị tốt ngay cả dưới ánh sáng mặt trời. Với hệ điều hành SteamOS, người dùng có thể truy cập toàn bộ thư viện Steam, cài thêm Windows, Epic Games hoặc các trình giả lập console cổ điển. Thiết kế công thái học được tối ưu cho các phiên chơi dài, cùng pin 40Wh cung cấp thời lượng sử dụng từ 2 đến 8 giờ tùy mức độ tải. Steam Deck 512GB là lựa chọn hoàn hảo cho game thủ yêu thích sự tự do — một chiếc PC thu nhỏ có thể mang đi mọi nơi.",
    "specs": {
      "CPU/GPU": "AMD Zen 2 + RDNA 2",
      "RAM": "16GB LPDDR5",
      "Lưu trữ": "512GB NVMe SSD",
      "Màn hình": "7 inch, 1280x800, chống chói",
      "Thời lượng pin": "2 - 8 giờ"
    },
    "image": "/Assets/image/products3.png",
    "gallery": [
      "/Assets/image/products3.png"
    ],
    "bonus": ["Tặng hộp đựng cứng cao cấp", "Hỗ trợ cập nhật firmware trọn đời"]
  },
  {
    "id": "C004",
    "name": "PlayStation Portal",
    "category": "Remote Handheld",
    "price": 6990000,
    "description": "Thiết bị chơi game cầm tay của Sony giúp truyền trực tiếp trò chơi từ PS5 qua Wi-Fi, cho phép bạn chơi mọi nơi trong nhà mà không cần TV.",
    "fullDescription": "PlayStation Portal là thiết bị Remote Play chính thức dành riêng cho PS5, được thiết kế để mang trải nghiệm console đến bất kỳ góc nào trong ngôi nhà bạn. Với màn hình LCD 8 inch độ phân giải Full HD và tay cầm DualSense tích hợp, Portal mang lại cảm giác chơi tương tự như khi sử dụng PS5 truyền thống. Nhờ công nghệ stream trực tiếp qua Wi-Fi, bạn có thể thưởng thức mọi tựa game PS5 mà không cần bật TV hay ngồi cố định trước máy. Portal không phải là một console độc lập mà là thiết bị mở rộng thông minh, giúp game thủ kết nối với thế giới PlayStation mọi lúc. Tay cầm DualSense trên Portal giữ nguyên các tính năng tiên tiến như phản hồi xúc giác và cò nhạy thích ứng, giúp bạn cảm nhận rõ từng chuyển động, va chạm hay lực căng trong game. Với pin dung lượng 4500mAh cho thời lượng sử dụng khoảng 8 giờ, cùng trọng lượng chỉ 530g, Portal là người bạn đồng hành lý tưởng cho những ai yêu thích sự tiện lợi, gọn nhẹ nhưng vẫn muốn giữ trọn trải nghiệm PS5 cao cấp.",
    "specs": {
      "Màn hình": "LCD 8 inch, 1080p, 60Hz",
      "Kết nối": "Wi-Fi, Bluetooth 5.1",
      "Pin": "4500mAh (khoảng 8 giờ)",
      "Tương thích": "PS5 (Remote Play)",
      "Trọng lượng": "530g"
    },
    "image": "/Assets/image/products4.png" ,
    "gallery": [
      "/Assets/image/products4.png" 
    ],
    "bonus": ["Tặng dây sạc USB-C", "Hỗ trợ kỹ thuật 24/7"]
  },
  {
    "id": "C005",
    "name": "Xbox Series X",
    "category": "Home Console",
    "price": 13990000,
    "description": "Máy console mạnh mẽ nhất của Microsoft, hỗ trợ chơi game 4K, HDR10 và tốc độ khung hình ổn định lên tới 120FPS.",
    "fullDescription": "Xbox Series X là cỗ máy console mạnh mẽ nhất mà Microsoft từng sản xuất, được tối ưu cho hiệu năng cao và tốc độ xử lý vượt trội. Trang bị CPU AMD Zen 2 8 nhân và GPU RDNA 2 với sức mạnh 12 teraflops, Xbox Series X mang lại hình ảnh chi tiết, mượt mà và sống động ở độ phân giải 4K. Ổ SSD 1TB thế hệ mới giúp tải game nhanh chóng, giảm thiểu thời gian chờ gần như tức thì. Công nghệ Quick Resume độc quyền cho phép người chơi chuyển đổi giữa nhiều tựa game mà không cần khởi động lại, cực kỳ tiện lợi. Hệ thống tản nhiệt được thiết kế theo dạng tháp, giúp máy vận hành êm ái và ổn định dù hoạt động lâu dài. Xbox Series X còn hỗ trợ HDR10, Dolby Atmos, Dolby Vision và khả năng chơi nội dung 8K, mang lại trải nghiệm nghe nhìn cao cấp. Với kho game đồ sộ từ Xbox Game Pass, bạn có thể khám phá hàng trăm tựa game chỉ với một gói đăng ký. Đây là lựa chọn lý tưởng cho game thủ muốn tận hưởng sức mạnh phần cứng hàng đầu cùng hệ sinh thái giải trí toàn diện của Microsoft.",
    "specs": {
      "CPU": "AMD Zen 2 8 nhân @3.8GHz",
      "GPU": "AMD RDNA 2 (12 TFLOPs)",
      "RAM": "16GB GDDR6",
      "Lưu trữ": "1TB SSD",
      "Độ phân giải": "Tối đa 4K@120Hz",
      "Trọng lượng": "4.45 kg"
    },
    "image": "/Assets/image/products2_1.png",
    "gallery": [
      "/Assets/image/products2_1.png"
    ],
    "bonus": ["Bảo hành chính hãng 12 tháng", "Tặng gói Game Pass 3 tháng"]
  },

  {
    "id": "p1",
    "name": "Xbox Game Pass",
    "category": "Console",
    "price": 16520000,
    "description": "Bộ điều khiển Xbox Game Pass chính hãng.",
    "fullDescription": "Xbox Game Pass mang đến trải nghiệm chơi game đỉnh cao với thiết kế công thái học, giúp người chơi cảm thấy thoải mái trong nhiều giờ liên tục. Tay cầm có độ nhạy cực cao, phản hồi chính xác từng chuyển động nhỏ. Sản phẩm hỗ trợ kết nối Bluetooth 5.0 ổn định, tương thích với nhiều thiết bị như Xbox, PC và điện thoại di động. Chất liệu nhựa cao cấp kết hợp bề mặt chống trượt giúp cầm nắm chắc chắn. Nút bấm được tinh chỉnh mềm mại hơn, giúp thao tác nhanh và êm ái. Game thủ có thể dễ dàng tùy chỉnh cấu hình điều khiển thông qua ứng dụng Xbox Accessories. Pin dung lượng lớn giúp chơi liên tục hàng giờ mà không cần sạc lại. Tay cầm còn được trang bị cổng âm thanh 3.5mm để kết nối tai nghe. Sản phẩm thích hợp cho cả người mới bắt đầu và game thủ chuyên nghiệp. Đây là lựa chọn tuyệt vời cho những ai muốn tận hưởng trải nghiệm chơi game mượt mà và chân thực nhất.",
    "image": "/Assets/image/console.webp",
    "gallery": ["/Assets/image/console.webp"],
    "bonus": ["Giảm 20%", "Bảo hành 12 tháng", "Tặng túi đựng cao cấp"],
    "specs": {
      "Kết nối": "Bluetooth 5.0",
      "Trọng lượng": "138g",
      "Tương thích": "Xbox, PC, Mobile"
    }
  },
  {
    "id": "p2",
    "name": "Meta Quest 3S",
    "category": "VR",
    "price": 18340000,
    "description": "Kính thực tế ảo Meta Quest 3S.",
    "fullDescription": "Meta Quest 3S là bước đột phá trong công nghệ thực tế ảo, mang đến trải nghiệm sống động và chân thực đến từng chi tiết. Với độ phân giải 4K sắc nét, mọi hình ảnh đều được tái hiện rõ ràng và tự nhiên. Bộ xử lý mạnh mẽ cho phép chạy mượt các ứng dụng và trò chơi VR cao cấp. Thiết kế nhẹ chỉ 450g giúp người dùng đeo lâu mà không mỏi cổ. Hệ thống âm thanh 3D tích hợp đem lại cảm giác nhập vai chân thực. Dung lượng 256GB giúp lưu trữ hàng trăm trò chơi và nội dung đa phương tiện. Sản phẩm hỗ trợ điều khiển bằng tay cầm cảm ứng nhạy, phản hồi chính xác từng cử động. Meta Quest 3S còn có khả năng theo dõi chuyển động toàn thân và hiển thị môi trường xung quanh với công nghệ passthrough. Đây là lựa chọn hoàn hảo cho game thủ, nhà sáng tạo nội dung và người yêu công nghệ. Kính thực tế ảo Meta Quest 3S mở ra một thế giới mới — nơi ranh giới giữa ảo và thật gần như biến mất.",
    "image": "/Assets/image/baner3.webp",
    "gallery": ["/Assets/image/baner3.webp"],
    "bonus": ["Giảm 20%", "Tặng tay cầm cảm ứng", "Bảo hành 24 tháng"],
    "specs": {
      "Độ phân giải": "4K",
      "Dung lượng": "256GB",
      "Trọng lượng": "450g"
    }
  },
  {
    "id": "p3",
    "name": "Xbox Game Pass 2",
    "category": "Console",
    "price": 9020000,
    "description": "Phiên bản nâng cấp Xbox Game Pass 2.",
    "fullDescription": "Sản phẩm kế nhiệm của Xbox Game Pass với cải tiến mạnh mẽ về hiệu năng và cảm giác cầm nắm. Tay cầm được tối ưu cho phản hồi rung chi tiết hơn. Tương thích hoàn hảo với Xbox Series X|S và PC. Bluetooth 5.1 giúp kết nối nhanh và ổn định hơn. Thiết kế mới với tông màu sang trọng và bền bỉ. Nút D-Pad cải tiến giúp điều khiển chính xác hơn. Hỗ trợ nhiều tựa game với chế độ rung đa tầng. Cổng USB-C cho tốc độ sạc nhanh hơn. Pin hoạt động liên tục hơn 30 giờ. Phù hợp cho game thủ muốn nâng cấp trải nghiệm.",
    "image": "/Assets/image/baner4.webp",
    "gallery": ["/Assets/image/baner4.webp"],
    "bonus": ["Giảm 20%", "Bảo hành 18 tháng", "Hỗ trợ kỹ thuật 24/7"],
    "specs": {
      "Kết nối": "Bluetooth 5.1",
      "Thời lượng pin": "30 giờ",
      "Tương thích": "Xbox Series X|S, PC"
    }
  },
  {
    "id": "p4",
    "name": "PlayStation 5",
    "category": "Console",
    "price": 20230000,
    "description": "Máy chơi game Sony PlayStation 5 chính hãng.",
    "fullDescription": "PlayStation 5 mang đến hiệu suất đột phá với CPU AMD Ryzen và GPU RDNA 2. Hỗ trợ độ phân giải 8K, tốc độ khung hình lên đến 120fps. Ổ cứng SSD siêu nhanh giúp rút ngắn thời gian tải game. Tay cầm DualSense mang lại cảm giác rung và phản hồi xúc giác chân thật. Thiết kế hiện đại, sang trọng và đậm chất tương lai. Tích hợp Wi-Fi 7 cho kết nối cực kỳ nhanh và ổn định. Hỗ trợ công nghệ âm thanh 3D Tempest. Kho game độc quyền phong phú từ Sony Studios. Tương thích ngược với hàng trăm tựa PS4. Là lựa chọn hàng đầu cho mọi game thủ hiện đại.",
    "image": "/Assets/image/ps5.webp",
    "gallery": ["/Assets/image/ps5.webp"],
    "bonus": ["Giảm 20%", "Tặng 1 tay cầm DualSense", "Bảo hành 24 tháng"],
    "specs": {
      "Bộ xử lý": "AMD Ryzen Zen 2 8 nhân",
      "GPU": "RDNA 2",
      "Lưu trữ": "SSD 825GB",
      "Kết nối": "Wi-Fi 7, Bluetooth 5.1"
    }
  }
]

